s = "Дана строка, состоящая из слов, разделенных пробелами. Определите, сколько в ней слов. Используйте для решения задачи функцию `count`"
print('\n', s, '\n', s.count(" ") + 1, sep="")
# print('\n', s, '\n', len(s.split()), sep="")

